# Projeto de Bases de Dados - Parte 3

### Docente Responsável

Prof. FirstName LastName

### Grupo GG
<dl>
    <dt>HH horas (33.3%)</dt>
    <dd>istxxxxxxxx FirstName LastName</dd>
    <dt>HH horas (33.3%)</dt>
    <dd>istxxxxxxxx FirstName LastName</dd>
    <dt>HH horas (33.3%)</dt>
    <dd>istxxxxxxxx FirstName LastName</dd>
<dl>

In [2]:
%load_ext sql
%sql postgresql://db:db@postgres/db

# Empresa de comércio online

## 0. Carregamento da Base de Dados

Carregue o esquema de Base de Dados apresentado no Anexo A.

In [3]:
%%sql

DROP TABLE IF EXISTS customer CASCADE;
DROP TABLE IF EXISTS orders CASCADE;
DROP TABLE IF EXISTS pay CASCADE;
DROP TABLE IF EXISTS employee CASCADE;
DROP TABLE IF EXISTS process CASCADE;
DROP TABLE IF EXISTS department CASCADE;
DROP TABLE IF EXISTS workplace CASCADE;
DROP TABLE IF EXISTS works CASCADE;
DROP TABLE IF EXISTS office CASCADE;
DROP TABLE IF EXISTS warehouse CASCADE;
DROP TABLE IF EXISTS product CASCADE;
DROP TABLE IF EXISTS contains CASCADE;
DROP TABLE IF EXISTS supplier CASCADE;
DROP TABLE IF EXISTS delivery CASCADE;
DROP TABLE IF EXISTS gs CASCADE;

CREATE TABLE customer(
cust_no INTEGER PRIMARY KEY,
name VARCHAR(80) NOT NULL,
email VARCHAR(254) UNIQUE NOT NULL,
phone VARCHAR(15),
address VARCHAR(255)
);

CREATE TABLE orders(
order_no INTEGER PRIMARY KEY,
cust_no INTEGER NOT NULL REFERENCES customer,
date DATE NOT NULL
--order_no must exist in contains
);

CREATE TABLE pay(
order_no INTEGER PRIMARY KEY REFERENCES orders,
cust_no INTEGER NOT NULL REFERENCES customer
);

CREATE TABLE employee(
ssn VARCHAR(20) PRIMARY KEY,
TIN VARCHAR(20) UNIQUE NOT NULL,
bdate DATE,
name VARCHAR NOT NULL
--age must be >=18
);

CREATE TABLE process(
ssn VARCHAR(20) REFERENCES employee,
order_no INTEGER REFERENCES orders,
PRIMARY KEY (ssn, order_no)
);

CREATE TABLE department(
name VARCHAR PRIMARY KEY
);

CREATE TABLE workplace(
address VARCHAR PRIMARY KEY,
lat NUMERIC(8, 6) NOT NULL,
long NUMERIC(9, 6) NOT NULL,
UNIQUE(lat, long)
--address must be in warehouse or office but not both
);

CREATE TABLE office(
address VARCHAR(255) PRIMARY KEY REFERENCES workplace
);

CREATE TABLE warehouse(
address VARCHAR(255) PRIMARY KEY REFERENCES workplace
);

CREATE TABLE works(
ssn VARCHAR(20) REFERENCES employee,
name VARCHAR(200) REFERENCES department,
address VARCHAR(255) REFERENCES workplace,
PRIMARY KEY (ssn, name, address)
);

CREATE TABLE product(
SKU VARCHAR(25) PRIMARY KEY,
name VARCHAR(200) NOT NULL,
description VARCHAR,
price NUMERIC(10, 2) NOT NULL,
ean NUMERIC(13) UNIQUE
);

CREATE TABLE contains(
order_no INTEGER REFERENCES orders,
SKU VARCHAR(25) REFERENCES product,
qty INTEGER,
PRIMARY KEY (order_no, SKU)
);

CREATE TABLE supplier(
TIN VARCHAR(20) PRIMARY KEY,
name VARCHAR(200),
address VARCHAR(255),
SKU VARCHAR(25) REFERENCES product,
date DATE
);

CREATE TABLE delivery(
address VARCHAR(255) REFERENCES warehouse,
TIN VARCHAR(20) REFERENCES supplier,
PRIMARY KEY (address, TIN)
);

Running query in 'postgresql://db:***@postgres/db'

Crie as instruções para o seu preenchimento de forma consistente, garantindo que todas as consultas SQL e OLAP, apresentadas mais adiante, produzam um resultado não vazio.

In [5]:
%%sql
-- populate.sql

-- Inserção de dados na tabela "customer"
INSERT INTO customer (cust_no, name, email, phone, address) VALUES
(1, 'John Smith', 'john.smith@example.com', '123456789', 'Rua da Liberdade, 1100-001 Lisboa'),
(2, 'Mary Johnson', 'mary.johnson@example.com', '987654321', 'Avenida dos Aliados, 4000-064 Porto'),
(3, 'Michael Brown', 'michael.brown@example.com', '555555555', 'Praça do Comércio, 1100-148 Lisboa'),
(4, 'Sarah Johnson', 'sarah.johnson@example.com', '111111111', 'Rua Augusta, 1100-053 Lisboa'),
(5, 'Robert Davis', 'robert.davis@example.com', '222222222', 'Rua de Santa Catarina, 4000-447 Porto'),
(6, 'Laura Wilson', 'laura.wilson@example.com', '333333333', 'Avenida da Liberdade, 1250-096 Lisboa'),
(7, 'William Thompson', 'william.thompson@example.com', '444444444', 'Rua de Cedofeita, 4050-179 Porto'),
(8, 'Emma Anderson', 'emma.anderson@example.com', '555555555', 'Rua do Carmo, 1200-093 Lisboa'),
(9, 'David Garcia', 'david.garcia@example.com', '666666666', 'Rua Mouzinho da Silveira, 4050-416 Porto'),
(10, 'Olivia Martin', 'olivia.martin@example.com', '777777777', 'Praça Luís de Camões, 1200-243 Lisboa');


-- Inserção de dados na tabela "orders"
INSERT INTO orders (order_no, cust_no, date) VALUES
(1, 1, '2021-01-10'),
(2, 2, '2021-02-15'),
(3, 3, '2021-03-20'),
(4, 4, '2021-04-25'),
(5, 5, '2021-05-30'),
(6, 6, '2021-06-05'),
(7, 7, '2021-07-10'),
(8, 8, '2022-01-20'),
(9, 9, '2022-01-20'),
(10, 10, '2022-02-25'),
(11, 1, '2022-03-25'),
(12, 5, '2022-03-25'),
(13, 4, '2022-04-25'),
(14, 2, '2022-07-25'),
(15, 3, '2022-12-25');


-- Inserção de dados na tabela "pay"
INSERT INTO pay (order_no, cust_no) VALUES
(1, 1),
(2, 2),
(3,3),
(4, 4),
(5, 5),
(6, 6),
(7, 7),
(8, 8),
(9, 9),
(10, 10);

-- Inserção de dados na tabela "employee"
INSERT INTO employee (ssn, TIN, bdate, name) VALUES
('111111111', 'TIN111', '1992-03-18', 'Sarah Wilson'),
('222222222', 'TIN222', '1985-06-25', 'Robert Johnson'),
('333333333', 'TIN333', '2003-09-12', 'Laura Davis'),
('444444444', 'TIN444', '1988-12-05', 'William Anderson'),
('555555555', 'TIN555', '1987-04-15', 'Emma Garcia'),
('666666666', 'TIN666', '1993-07-21', 'David Thompson'),
('777777777', 'TIN777', '1989-10-28', 'Olivia Martin');

-- Inserção de dados na tabela "process"
INSERT INTO process (ssn, order_no) VALUES
('111111111', 4),
('222222222', 5),
('333333333', 6),
('444444444', 7),
('555555555', 8),
('666666666', 9),
('666666666', 10),
('666666666', 11),
('666666666', 12),
('666666666', 13),
('666666666', 14),
('666666666', 15);

-- Inserção de dados na tabela "department"
INSERT INTO department (name) VALUES
('Sales'),
('Finance'),
('Marketing'),
('Human Resources'),
('IT'),
('Operations'),
('Customer Service');

-- Inserção de dados na tabela "workplace"
INSERT INTO workplace (address, lat, long) VALUES
('123 Main St', 12.345678, -98.765432),
('456 Elm St', 23.456789, -87.654321),
('789 Oak St', 34.567890, -76.543210),
('321 Cedar St', 45.678901, -65.432109),
('654 Pine St', 56.789012, -54.321098),
('876 Maple St', 67.890123, -43.210987),
('543 Birch St', 78.901234, -32.109876);

INSERT INTO office (address) VALUES
('123 Main St'),
('456 Elm St'),
('789 Oak St');

-- Inserção de dados na tabela "warehouse"
INSERT INTO warehouse (address) VALUES
('321 Cedar St'),
('654 Pine St'),
('876 Maple St'),
('543 Birch St');


-- Inserção de dados na tabela "works"
INSERT INTO works (ssn, name, address) VALUES
('111111111', 'Sales', '123 Main St'),
('222222222', 'Finance', '456 Elm St'),
('333333333', 'Marketing', '789 Oak St'),
('444444444', 'Human Resources', '321 Cedar St'),
('555555555', 'IT', '654 Pine St'),
('666666666', 'Operations', '876 Maple St'),
('777777777', 'Customer Service', '543 Birch St');

-- Inserção de dados na tabela "product"
INSERT INTO product (SKU, name, description, price, ean) VALUES
('MB-LCD-42-P-001', 'Product 1', 'Description 1', 9.99, 1234567890123),
('FOR-LUM-001-PR-002', 'Product 2', 'Description 2', 12.99, 9876543210987),
('LEV-JN-SN-36-GN-003', 'Product 3', 'Description 3', 15.99, 1234567890124),
('MB-LCD-42-P-004', 'Product 4', 'Description 4', 9.99, 9876543210986),
('FOR-LUM-001-PR-005', 'Product 5', 'Description 5', 12.99, 1111111111111),
('LEV-JN-SN-36-GN-006', 'Product 6', 'Description 6', 8.99, 2222222222222),
('MB-LCD-42-P-007', 'Product 7', 'Description 7', 19.99, 3333333333333),
('FOR-LUM-001-PR-008', 'Product 8', 'Description 8', 14.99, 4444444444444),
('LEV-JN-SN-36-GN-009', 'Product 9', 'Description 9', 11.99, 5555555555555),
('MB-LCD-42-P-010', 'Product 10', 'Description 10', 17.99, 6666666666666),
('FOR-LUM-001-PR-011', 'Product 11', 'Description 11', 9.99, 7777777777777),
('LEV-JN-SN-36-GN-012', 'Product 12', 'Description 12', 14.99, 8888888888888),
('MB-LCD-42-P-013', 'Product 13', 'Description 13', 11.99, 9999999999999),
('FOR-LUM-001-PR-014', 'Product 14', 'Description 14', 7.99, 1010101010101);

-- Inserção de dados na tabela "contains"
INSERT INTO contains (order_no, SKU, qty) VALUES
(1, 'MB-LCD-42-P-001', 2),
(2, 'FOR-LUM-001-PR-002', 1),
(3, 'LEV-JN-SN-36-GN-003', 3),
(4, 'MB-LCD-42-P-004', 2),
(5, 'FOR-LUM-001-PR-005', 1),
(6, 'LEV-JN-SN-36-GN-006', 4),
(7, 'MB-LCD-42-P-007', 3),
(8, 'FOR-LUM-001-PR-008', 2),
(9, 'LEV-JN-SN-36-GN-009', 1),
(10, 'MB-LCD-42-P-010', 3),
(1, 'FOR-LUM-001-PR-011', 2),
(2, 'LEV-JN-SN-36-GN-012', 1),
(3, 'MB-LCD-42-P-013', 4),
(4, 'FOR-LUM-001-PR-014', 3),
(5, 'MB-LCD-42-P-001', 2),
(6, 'FOR-LUM-001-PR-002', 1),
(7, 'LEV-JN-SN-36-GN-003', 3),
(8, 'MB-LCD-42-P-004', 2),
(9, 'FOR-LUM-001-PR-005', 1),
(10, 'LEV-JN-SN-36-GN-006', 4),
(1, 'MB-LCD-42-P-007', 3),
(2, 'FOR-LUM-001-PR-008', 2),
(3, 'LEV-JN-SN-36-GN-009', 1),
(4, 'MB-LCD-42-P-010', 3),
(5, 'FOR-LUM-001-PR-011', 2),
(6, 'LEV-JN-SN-36-GN-012', 1),
(7, 'MB-LCD-42-P-013', 4),
(8, 'FOR-LUM-001-PR-014', 3),
(9, 'MB-LCD-42-P-001', 2),
(10, 'FOR-LUM-001-PR-002', 1),
(1, 'LEV-JN-SN-36-GN-003', 3),
(2, 'MB-LCD-42-P-004', 2),
(3, 'FOR-LUM-001-PR-005', 1),
(4, 'LEV-JN-SN-36-GN-006', 4),
(5, 'MB-LCD-42-P-007', 3),
(6, 'FOR-LUM-001-PR-008', 2),
(7, 'LEV-JN-SN-36-GN-009', 1),
(8, 'MB-LCD-42-P-010', 3),
(9, 'FOR-LUM-001-PR-011', 2),
(10, 'LEV-JN-SN-36-GN-012', 1),
(1, 'MB-LCD-42-P-013', 4),
(2, 'FOR-LUM-001-PR-014', 3),
(3, 'MB-LCD-42-P-001', 2),
(4, 'FOR-LUM-001-PR-002', 1),
(5, 'LEV-JN-SN-36-GN-003', 3),
(6, 'MB-LCD-42-P-004', 2),
(7, 'FOR-LUM-001-PR-005', 1),
(8, 'LEV-JN-SN-36-GN-006', 4),
(9, 'MB-LCD-42-P-007', 3),
(10, 'FOR-LUM-001-PR-008', 2),
(1, 'LEV-JN-SN-36-GN-009', 1),
(2, 'MB-LCD-42-P-010', 3),
(3, 'FOR-LUM-001-PR-011', 2),
(4, 'LEV-JN-SN-36-GN-012', 1),
(5, 'MB-LCD-42-P-013', 4),
(6, 'FOR-LUM-001-PR-014', 3),
(7, 'MB-LCD-42-P-001', 2),
(8, 'FOR-LUM-001-PR-002', 1),
(9, 'LEV-JN-SN-36-GN-003', 3),
(10, 'MB-LCD-42-P-004', 2);

-- Inserção de dados na tabela "supplier"
INSERT INTO supplier (TIN, name, address, SKU, date) VALUES
('TIN001', 'Supplier 1', '123 Supplier St', 'MB-LCD-42-P-001', '2022-01-01'),
('TIN002', 'Supplier 2', '456 Supplier St', 'FOR-LUM-001-PR-002', '2022-02-05'),
('TIN003', 'Supplier 3', '789 Supplier St', 'LEV-JN-SN-36-GN-003', '2022-03-10'),
('TIN004', 'Supplier 4', '321 Supplier St', 'MB-LCD-42-P-004', '2022-04-15'),
('TIN005', 'Supplier 5', '654 Supplier St', 'FOR-LUM-001-PR-005', '2022-05-20'),
('TIN006', 'Supplier 6', '876 Supplier St', 'LEV-JN-SN-36-GN-006', '2022-06-25'),
('TIN007', 'Supplier 7', '543 Supplier St', 'MB-LCD-42-P-007', '2022-07-30');

-- Inserção de dados na tabela "delivery"
INSERT INTO delivery (address, TIN) VALUES
('321 Cedar St', 'TIN001'),
('654 Pine St', 'TIN002'),
('876 Maple St', 'TIN003'),
('543 Birch St', 'TIN004');

INSERT INTO product_photos (product_sku, photo_url)
VALUES 
    ('SKU001', 'static/images/product1.jpg'),
    ('SKU002', 'static/images/product2.jpg'),
    ('SKU003', 'static/images/product3.jpg'),
    ('SKU004', 'static/images/product4.jpg'),
    ('SKU005', 'static/images/product5.jpg'),
    ('SKU006', 'static/images/product6.jpg'),
    ('SKU007', 'static/images/product7.jpg'),
    ('SKU008', 'static/images/product8.jpg'),
    ('SKU009', 'static/images/product9.jpg'),
    ('SKU010', 'static/images/product10.jpg'),
    ('SKU011', 'static/images/product11.jpg'),
    ('SKU012', 'static/images/product12.jpg'),
    ('SKU013', 'static/images/product13.jpg'),
    ('SKU014', 'static/images/product14.jpg'),
    ('SKU015', 'static/images/product15.jpg'),
    ('SKU016', 'static/images/product16.jpg'),
    ('SKU017', 'static/images/product17.jpg'),
    ('SKU018', 'static/images/product18.jpg'),
    ('SKU019', 'static/images/product19.jpg'),
    ('SKU020', 'static/images/product20.jpg');

Running query in 'postgresql://db:***@postgres/db'

10 rows affected.

10 rows affected.

10 rows affected.

7 rows affected.

7 rows affected.

7 rows affected.

7 rows affected.

3 rows affected.

4 rows affected.

7 rows affected.

14 rows affected.

60 rows affected.

7 rows affected.

4 rows affected.

In [4]:
%%sql
-- populate

CREATE TABLE IF NOT EXISTS gs (
  n INTEGER
);

INSERT INTO gs(n)
SELECT generate_series
FROM generate_series(1, 50000);

-- table "customer"
INSERT INTO customer (cust_no, name, email, phone, address)
SELECT
  n AS cust_no,
  'Customer ' || n AS name,
  'customer' || n || '@example.com' AS email,
  '987654321' AS phone,
  'Rua ' || n || ', '|| n || n || n || n || '-' || n || n || n || ' Vila ' || n  AS address
FROM gs;

-- table "orders"
INSERT INTO orders (order_no, cust_no, date)
SELECT
  n AS order_no,
  FLOOR(random() * 50000) + 1 AS cust_no,
  CURRENT_DATE - (random() * 365*10)::int AS date
FROM gs;

-- table "pay"
INSERT INTO pay (order_no, cust_no)
SELECT
  t_rands.my_order_no,
  (SELECT cust_no FROM orders o WHERE o.order_no = t_rands.my_order_no) AS cust_no
FROM (
  SELECT DISTINCT FLOOR(random() * 50000) + 1 AS my_order_no
  FROM gs
  LIMIT FLOOR(50000 / 2)
) AS t_rands;

-- table "employee"
INSERT INTO employee (ssn, TIN, bdate, name)
SELECT
  'SSN' || n AS ssn,
  'TIN' || n AS TIN,
  (date_trunc('year', current_date) - interval '18 years' - random() * interval '365 days')::date AS bdate,
  'Employee ' || n AS name
FROM gs;

-- table "process"
INSERT INTO process (ssn, order_no)
SELECT
    'SSN' || my_ssn AS ssn,
    (SELECT FLOOR(random() * 50000) + 1 FROM gs LIMIT 1) AS order_no
FROM (
  SELECT DISTINCT FLOOR(random() * 50000) + 1 AS my_ssn
  FROM gs
  LIMIT FLOOR(50000 / 2)
) AS t_rands;

-- table "department"
INSERT INTO department (name)
SELECT
  'Department ' || n
FROM gs
LIMIT FLOOR(50000/500);

-- table "workplace"
INSERT INTO workplace (address, lat, long)
SELECT
  'Rua ' || n || ', '|| n || n || n || n || '-' || n || n || n || ' Cidade ' || n  AS address,
  (my_lat_long * 180) - 90 AS lat,
  (my_lat_long * 360) - 180 AS long
FROM (
  SELECT DISTINCT n, random() AS my_lat_long
  FROM gs
  LIMIT FLOOR(50000/100)
) AS t_rands;

-- table "office"
INSERT INTO office (address)
SELECT
  address
FROM workplace
ORDER BY random()
LIMIT 50000/100/2;

-- table "warehouse"
INSERT INTO warehouse (address)
SELECT
  address
FROM workplace
WHERE address NOT IN (SELECT * FROM office);

-- table "works"
INSERT INTO works (ssn, name, address)
SELECT
      e.ssn,
      (SELECT 'Department ' || FLOOR(50000/500 * random() + 1) FROM gs LIMIT 1) AS name,
      (SELECT address FROM workplace ORDER BY random() LIMIT 1) AS address
FROM employee AS e
LIMIT 50000;

-- table "product"
INSERT INTO product (SKU, name, description, price, ean)
SELECT
  'SKU' || n AS SKU,
  'Product ' || n AS name,
  'Description for Product ' || n AS description,
  (random() * 500)::numeric(10, 2) AS price,
  n AS ean
FROM gs;

-- table "contains"
INSERT INTO contains (order_no, SKU, qty)
SELECT DISTINCT
    order_no,
    SKU,
    FLOOR(random() * 10 + 1) AS qty
FROM (SELECT DISTINCT FLOOR(50000 * random() + 1) AS order_no,
        'SKU' || FLOOR(50000 * random() + 1) AS SKU
    FROM generate_series(1, 2000*4)) AS pairs;

-- table "supplier"
INSERT INTO supplier (TIN, name, address, SKU, date)
SELECT
  'TIN' || n AS TIN,
  'Supplier ' || n AS name,
  'Rua ' || n || ', '|| n || n || n || n || '-' || n || n || n || ' Cidade ' || n  AS address,
  (SELECT 'SKU' || FLOOR(50000 * random() + 1) FROM gs LIMIT 1) AS SKU,
  CURRENT_DATE - (random() * 365 * 2)::int AS date
FROM gs;

-- table "delivery"
INSERT INTO delivery (address, TIN)
SELECT
  pairs.new_address,
  pairs.TIN
FROM (SELECT DISTINCT (SELECT address FROM warehouse ORDER BY random() LIMIT 1) AS new_address,
                              'TIN' || FLOOR(50000 * random() + 1) AS TIN FROM gs) AS pairs
LIMIT FLOOR(50000/100/2 * 10);

Running query in 'postgresql://db:***@postgres/db'

50000 rows affected.

50000 rows affected.

50000 rows affected.

25000 rows affected.

50000 rows affected.

25000 rows affected.

100 rows affected.

500 rows affected.

250 rows affected.

250 rows affected.

50000 rows affected.

50000 rows affected.

8000 rows affected.

50000 rows affected.

2500 rows affected.

## 1. Restrições de Integridade

Apresente o código para implementar as seguintes restrições de integridade, se necessário, com recurso a extensões procedimentais SQL (Stored Procedures e Triggers):

(RI-1) Nenhum empregado pode ter menos de 18 anos de idade

In [ ]:
%%sql
-- (RI-1)
ALTER TABLE employee
ADD CONSTRAINT employee_age_check
CHECK (age(bdate) >= INTERVAL '18 years');

(RI-2) Um 'Workplace' é obrigatoriamente um 'Office' ou 'Warehouse' mas não pode ser ambos

In [ ]:
%%sql
-- (RI-2)

-- Function to check if workplace is an Office or Warehouse but not both
CREATE OR REPLACE FUNCTION workplace_type() RETURNS TRIGGER AS
$$
BEGIN

    IF NEW.address NOT IN (SELECT address FROM office) AND NEW.address NOT IN (SELECT address FROM warehouse) THEN
        RAISE EXCEPTION 'A Workplace has to be an Office or a Warehouse.';
    END IF;

    RETURN NEW;
END;
$$ LANGUAGE plpgsql;

-- Trigger for workplace
CREATE CONSTRAINT TRIGGER workplace_type_trigger
AFTER INSERT OR UPDATE ON workplace DEFERRABLE INITIALLY DEFERRED
FOR EACH ROW EXECUTE FUNCTION workplace_type();


-- Function to check if warehouse new address is in office
CREATE OR REPLACE FUNCTION in_office() RETURNS TRIGGER AS
$$
BEGIN
    IF NEW.address IN (SELECT address FROM office) THEN
        RAISE EXCEPTION 'Already an Office';
    END IF;
    RETURN NEW;
END;
$$ LANGUAGE plpgsql;

-- Trigger for warehouse
CREATE OR REPLACE TRIGGER in_office_trigger
BEFORE INSERT OR UPDATE ON warehouse 
FOR EACH ROW EXECUTE FUNCTION in_office();

-- Function to check if office new address is in warehouse
CREATE OR REPLACE FUNCTION in_warehouse() RETURNS TRIGGER AS
$$
BEGIN
    IF NEW.address IN (SELECT address FROM warehouse) THEN
        RAISE EXCEPTION 'Already a Warehouse';
    END IF;
    RETURN NEW;
END;
$$ LANGUAGE plpgsql;

-- Trigger for office
CREATE OR REPLACE TRIGGER in_warehouse_trigger
BEFORE INSERT OR UPDATE ON office 
FOR EACH ROW EXECUTE FUNCTION in_warehouse();

(RI-3) Uma 'Order' tem de figurar obrigatoriamente em 'Contains'.

In [ ]:
%%sql
-- (RI-3)
-- Function to check if workplace is an Office or Warehouse but not both
CREATE OR REPLACE FUNCTION order_in_contains() RETURNS TRIGGER AS
$$
BEGIN

    IF NEW.order_no NOT IN (SELECT order_no FROM contains) THEN
        RAISE EXCEPTION 'An order has to be in contains';
    END IF;

    RETURN NEW;
END;
$$ LANGUAGE plpgsql;

-- Trigger for workplace
CREATE CONSTRAINT TRIGGER order_in_contains_trigger
AFTER INSERT OR UPDATE ON orders DEFERRABLE INITIALLY DEFERRED
FOR EACH ROW EXECUTE FUNCTION order_in_contains();

## 2. Consultas SQL

Apresente a consulta SQL mais sucinta para cada uma das seguintes questões

1) Qual o número e nome do(s) cliente(s) com maior valor total de encomendas pagas?

In [ ]:
%%sql
SELECT c.cust_no, c.name 
FROM customer as c
    JOIN pay USING(cust_no)
    JOIN orders USING(order_no)
    JOIN contains USING(order_no)
    JOIN product USING(SKU)
GROUP BY c.cust_no
HAVING sum(qty * price) >= ALL
   ( SELECT sum(qty * price) 
FROM customer as c2
    JOIN pay USING (cust_no)
    JOIN orders USING(order_no)
    JOIN contains USING(order_no)
    JOIN product USING(SKU)
GROUP BY c2.cust_no
);

2. Qual o nome dos empregados que processaram encomendas em todos os dias de 2022 em que houve encomendas?

In [ ]:
%%sql
SELECT DISTINCT e.name 
FROM employee as e
WHERE NOT EXISTS (
    SELECT o.date
    FROM orders as o
    WHERE EXTRACT(YEAR FROM o.date) = '2022'
    EXCEPT
    SELECT o1.date
    FROM orders as o1
    JOIN process p USING(order_no)
    WHERE e.ssn = p.ssn);

3. Quantas encomendas foram realizadas mas não pagas em cada mês de 2022?

In [ ]:
%%sql
SELECT months.month, COALESCE(orders_count."unpaid orders", 0) AS "unpaid orders"
FROM (
    SELECT to_char(date_trunc('month', generate_series), 'Month') AS month
    FROM generate_series(
      date_trunc('year', current_date),
      date_trunc('year', current_date) + interval '1 year - 1 day',
      interval '1 month'
    ) AS generate_series
) AS months
LEFT JOIN (
    SELECT to_char(o.date, 'Month') AS month, count(*) AS "unpaid orders"
    FROM orders AS o
    WHERE EXTRACT(YEAR FROM o.date) = '2022' 
    AND o.order_no NOT IN (SELECT p.order_no FROM pay AS p)
    GROUP BY month
) AS orders_count ON months.month = orders_count.month;

## 3. Vistas

Crie uma vista que resuma as informações mais importantes sobre as vendas de produtos, combinando informações de diferentes tabelas do esquema de base de dados. A vista deve ter o seguinte esquema:

product_sales(sku, order_no, qty, total_price, year, month, day_of_month, day_of_week, city)

In [ ]:
%%sql
-- CREATE VIEW ...
CREATE OR REPLACE VIEW product_sales AS
SELECT pro.sku, o.order_no, cnt.qty, cnt.qty * pro.price AS total_price, EXTRACT (YEAR from o.date) as year, EXTRACT(MONTH FROM o.date) as month, EXTRACT (DAY FROM o.date) as day_of_month, EXTRACT(DOW FROM o.date) as day_of_week, SUBSTRING(c.address, POSITION('-' IN address) + 5) AS city
FROM customer AS c
    JOIN pay AS p USING(cust_no)
    JOIN orders as o USING(order_no)
    JOIN contains as cnt USING(order_no)
    JOIN product as pro USING(sku)
ORDER BY pro.sku, o.date;

SELECT * FROM product_sales;

## 4. Desenvolvimento de Aplicação

### Explicação da arquitetura da aplicação web, incluindo um link para uma versão de trabalho e as relações entre os vários ficheiros na pasta web/arquivos

...

In [ ]:
%%sql
CREATE TABLE product_photos (
    id SERIAL PRIMARY KEY,
    product_sku VARCHAR(25) NOT NULL,
    photo_url VARCHAR(255) NOT NULL,
    FOREIGN KEY (product_sku) REFERENCES product (SKU)
);

## 5. Consultas OLAP

Usando a vista desenvolvida para a Questão 3, escreva duas consultas SQL que permitam analisar:

1. As quantidade e valores totais de venda de cada produto em 2022, globalmente, por cidade, por mês, dia do mês e dia da semana

In [ ]:
%%sql
DROP TABLE IF EXISTS dim_date CASCADE;

CREATE TABLE dim_date (
    year INTEGER,
    month INTEGER,
    day_of_month INTEGER,
    day_of_week INTEGER
);

INSERT INTO dim_date ( year, month, day_of_month, day_of_week)
SELECT
    EXTRACT(YEAR FROM date) AS year,
    EXTRACT(MONTH FROM date) AS month,
    EXTRACT(DAY FROM date) AS day_of_month,
    EXTRACT(DOW FROM date) AS day_of_week
FROM
    generate_series('2022-01-01'::date, '2022-12-31'::date, '1 day') AS date;

-- SELECT ...
SELECT
    sku,
    COALESCE(SUM(qty),0) AS total_quantity,
    COALESCE(SUM(total_price),0) AS total_value,
    city,
    month,
    day_of_month,
    day_of_week
FROM 
    (
    SELECT
        d.year,
        d.month,
        d.day_of_month,
        d.day_of_week,
        ps.sku,
        ps.qty,
        ps.total_price,
        ps.city
    FROM
        dim_date AS d
    LEFT JOIN
        (
            SELECT
                year,
                month,
                day_of_month,
                day_of_week,
                sku,
                qty,
                total_price,
                city
            FROM
                product_sales
            WHERE
                year = 2022
        ) AS ps ON d.year = ps.year
                  AND d.month = ps.month
                  AND d.day_of_month = ps.day_of_month
                  AND d.day_of_week = ps.day_of_week
    ) AS big_table
GROUP BY
    GROUPING SETS ((sku),(sku,city),(sku,month), (sku,day_of_month) , (sku,day_of_week), (month,day_of_month))
ORDER BY
    sku,
    month,
    day_of_month,
    day_of_week;

2. O valor médio diário das vendas de todos os produtos em 2022, globalmente, por mês e dia da semana

In [ ]:
%%sql
DROP TABLE IF EXISTS dim_date CASCADE;

CREATE TABLE dim_date (
    year INTEGER,
    month INTEGER,
    day_of_month INTEGER,
    day_of_week INTEGER
);

INSERT INTO dim_date ( year, month, day_of_month, day_of_week)
SELECT
    EXTRACT(YEAR FROM date) AS year,
    EXTRACT(MONTH FROM date) AS month,
    EXTRACT(DAY FROM date) AS day_of_month,
    EXTRACT(DOW FROM date) AS day_of_week
FROM
    generate_series('2022-01-01'::date, '2022-12-31'::date, '1 day') AS date;

-- Tentativa 1
SELECT
    d.month,
    d.day_of_week,
    COALESCE(ROUND(AVG(ps.total_price),4), 0) AS average_daily_sales
FROM
    dim_date AS d
LEFT JOIN
    product_sales AS ps ON d.year = ps.year
                         AND d.month = ps.month
                         AND d.day_of_week = ps.day_of_week
WHERE
    d.year = 2022
GROUP BY
    GROUPING SETS ((), (d.month), (d.day_of_week), (d.month, d.day_of_week))
ORDER BY
    d.month, d.day_of_week;

## 6. Índices

Indique, com a devida justificação, que tipo de índice(s), sobre qual(is) atributo(s) e sobre qual(is) tabela(s) faria sentido criar, de forma a agilizar a execução de cada uma das seguintes consultas:

### 6.1
SELECT order_no
FROM orders 
JOIN contains USING (order_no) 
JOIN product USING (SKU) 
WHERE price > 50 AND 
EXTRACT(YEAR FROM date) = 2023

### Tipo de Índice, Atributos & Justificação

Índice do tipo B-Tree na tabela orders sobre o atributo date uma vez que ao organizar de forma ordenada numa árvore auto-balanceada os dados, é ideal para consultas de range permitindo uma procura mais rápida pelos dados que atendem à condição EXTRACT(YEAR FROM date) = 2023.
Índice do tipo B-Tree na tabela product sobre o atributo price pelas mesmas razões referidas anteriormente, considerando uma range diferente (price > 50).

### 6.2
SELECT order_no, SUM(qty*price)
FROM contains 
JOIN product USING (SKU) 
WHERE name LIKE ‘A%’ 
GROUP BY order_no;

### Tipo de Índice, Atributos & Justificação

Índice do tipo B-Tree na tabela product sobre o atributo name uma vez que ao organizar de forma ordenada numa árvore auto-balanceada os dados, é ideal para consultas de range permitindo uma procura mais rápida pelos dados que começam por uma certa letra (neste caso 'A').
Índice do tipo B-Tree na tabela contains sobre o atributo order_no pelas mesmas razões referidas anteriormente, considerando uma range diferente (price > 50).facilitando a agrupação eficiente